---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarCoverType
source: html/b90685db-d2c5-aecb-ff1f-425ca2e5fae9.htm
---
# Autodesk.Revit.DB.Structure.RebarCoverType

A named value for a clear cover distance.

## Syntax (C#)
```csharp
public class RebarCoverType : ElementType
```

## Remarks
In Revit Structure, CoverTypes are the rows in the Rebar Cover Settings dialog.